performance_test.yml
# EVALUACION DE PRESTACIONES CON TAURUS
execution:
    - concurrency: 10   # 10 usuarios de forma simultanea
      ramp-up: 10s      # llegar a 10 usuarios en 10 segundos
      hold-for: 50s     # tiempo que un usuario esta conectado
      scenario: portatiles-test  # ¿Cual escenario se selecciona?

#Posibles escenarios
scenarios:
    #Escenario microservicio PORTATILES
    portatiles-test:
      requests:
      #Prueba basica: REST DE TRANSACIONES
      - url: http://localhost:8080/portatiles/
        method: GET
      #Numero de portatiles en la BD
      - url: http://localhost:8080/portatiles/numeroPortatilesEnBD
        method: GET
      #Seleccionar un portatil en concreto
      - url: http://localhost:8080/portatiles/seleccionarPortatil/5e2cfeefd46dbb220a0d96
        method: GET
      #Ver portatiles que vende un usuario
      - url: http://localhost:8080/portatiles/verPortatilesEnVentaDeUsuario/358D
        method: GET
    #Escenenario microservicio TRANSACCIONES
    transacciones-test:
        requests:
        #Prueba basica: REST DE TRANSACIONES
        - url: http://localhost:8000/transacciones/
          method: GET
        #Algun portatil en la base de datos con ese usuario introducido
        - once:
          - url: http://localhost:8000/transacciones/verEstadisticas/339X
            method: GET